Repository: asanaliwhy/ASSIGNMENT-6-7
Catalog: lib/l10n/app_*.arb
Languages: kk

source: Login
kk: Кіру

source: Register
kk: Тіркелу

source: Email
kk: Электрондық пошта

source: Password
kk: Құпия сөз

source: Name
kk: Аты

source: Surname
kk: Тегі

# createAccount
source: Create an account
kk: Тіркелгі жасау

source: Sign in with Google
kk: Google арқылы кіру

source: Sign in with Facebook
kk: Facebook арқылы кіру

source: Home
kk: Басты бет

source: Progress
kk: Жетістіктер

source: Exercises
kk: Жаттығулар

source: Community
kk: Қауымдастық

source: No Favorites
kk: Тандаулыларсыз

source: Profile
kk: Профиль

source: Logout
kk: Шығу

source: Search
kk: Іздеу

source: Sort by
kk: Сұрыптау

# titleAsc
source: Title (A-Z)
kk: Атауы (А-Я)

# titleDesc
source: Title (Z-A)
kk: Атауы (Я-А)

# progressAsc
source: Progress (Low to High)
kk: Жетістік (төменнен жоғарыға)

# progressDesc
source: Progress (High to Low)
kk: Жетістік (жоғарыдан төменге)

# durationAsc
source: Duration (Short to Long)
kk: Ұзақтығы (қысқа - ұзын)

# durationDesc
source: Duration (Long to Short)
kk: Ұзақтығы (ұзын - қысқа)

source: Not found
kk: Табылған жоқ

source: Challenges
kk: Сынақтар

source: Gyms Near Me
kk: Маған жақын жаттығу залдары

source: Workout Plans
kk: Жаттығу жоспарлары

source: Started
kk: Басталды

source: Completed
kk: Аяқталды

# completedStats
source: Completed
kk: Аяқталған

source: Workouts
kk: Жаттығу

source: Minutes
kk: Минут

source: Overall Progress
kk: Жалпы жетістік

# weekNumber
source: Week {weekIndex}
kk: {weekIndex}-апта

source: Done
kk: Аяқталды

source: New Post
kk: Жаңа жазба

source: Edit Post
kk: Жазбаны өңдеу

source: Delete Post
kk: Жазбаны жою

source: Title
kk: Тақырып

source: Enter post title
kk: Жазба тақырыбын енгізіңіз

# postText
source: Text
kk: Мәтін

source: Text
kk: Мәтін

# shareThoughts
source: Share your thoughts...
kk: Ойларыңызды бөлісіңіз...

# fillBothFields
source: Please fill in both fields
kk: Екі өрісті де толтырыңыз

# postCancel
source: Cancel
kk: Бас тарту

source: Cancel
kk: Бас тарту

# postSubmit
source: Post
kk: Жариялау

source: Post
kk: Жазба

# postSave
source: Save
kk: Сақтау

source: Save
kk: Сақтау

# postDeleteConfirm
source: Are you sure you want to delete this post?
kk: Осы жазбаны жойғыңыз келетініне сенімдісіз бе?

# confirmDeletePost
source: Are you sure you want to delete this post?
kk: Осы жазбаны жойғыңыз келетініне сенімдісіз бе?

# postDeleteYes
source: Yes
kk: Иә

# postDeleteNo
source: No
kk: Жоқ

source: Yes
kk: Иә

source: No
kk: Жоқ

# likes
source: {count} Likes
kk: {count} ұнады

# likesLabel
source: Likes
kk: Ұнатулар

source: Body Part
kk: Дене бөлігі

source: Equipment
kk: Жабдықтар

source: Difficulty
kk: Қиындық деңгейі

source: Goal cannot be empty
kk: Мақсат бос болуы мүмкін емес

# bodyPartLabel
source: Body Part:
kk: Дене бөлігі:

# equipmentLabel
source: Equipment:
kk: Жабдықтар:

# difficultyLabel
source: Difficulty:
kk: Қиындық деңгейі:

source: Steps
kk: Қадамдар

# stepsLabel
source: Steps:
kk: Қадамдар:

source: VIEW DETAILS
kk: ЕГЖЕЙ-ТЕГЖЕЙІН КӨРУ

# enterGoal
source: Enter your goal
kk: Мақсатыңызды енгізіңіз

source: Enter your goal
kk: Мақсатыңызды енгізіңіз

source: Add Goal
kk: Мақсат қосу

source: Fitness Goals
kk: Фитнес мақсаттары

source: Edit Goal
kk: Мақсатты өңдеу

source: Goal
kk: Мақсат

source: Delete Goal
kk: Мақсатты жою

# goalProgress
source: {percent}% Complete
kk: {percent}% Аяқталды

# percentCompleted
source: % Completed
kk: % Аяқталды

# percentComplete
source: % Complete
kk: % Аяқталды

# deleteGoalConfirm
source: Are you sure you want to delete this goal?
kk: Осы мақсатты жойғыңыз келе ме?

# confirmDeleteGoal
source: Are you sure you want to delete this goal?
kk: Осы мақсатты жойғыңыз келе ме?

# saveGoal
source: Save
kk: Мақсатты сақтау

source: Favorites
kk: Таңдаулылар

source: Reset Progress
kk: Жетістікті қалпына келтіру

# resetProgressConfirm
source: Reset progress for {title}?
kk: {title} үшін прогресті қайта бастау керек пе?

# confirmResetProgress
source: Reset progress for {title}?
kk: {title} үшін прогресті қайта бастау керек пе?

source: Reset
kk: Қалпына келтіру

source: Progress Chart
kk: Жетістік диаграммасы

source: Your Progress
kk: Сіздің жетістігіңіз

source: Search Posts
kk: Жазбаларды іздеу

source: Text not found
kk: Мәтін табылмады

source: Gym Location
kk: Залдың орналасуы

source: Settings
kk: Баптаулар

source: Language
kk: Тіл

source: Select Language
kk: Тілді таңдаңыз

source: English
kk: Ағылшын

source: Kazakh
kk: Қазақ

source: Russian
kk: Орыс

# errorUserNotFound
source: No user found for that email.
kk: Бұл электрондық поштамен пайдаланушы табылмады.

# errorWrongPassword
source: Incorrect password.
kk: Құпия сөз қате.

# errorEmailInUse
source: The email is already registered.
kk: Бұл электрондық пошта тіркелген.

# errorInvalidEmail
source: The email address is invalid.
kk: Электрондық пошта мекенжайы жарамсыз.

# errorAuthGeneric
source: An authentication error occurred.
kk: Аутентификация қатесі орын алды.

# errorGeneric
source: An unexpected error occurred: {message}
kk: Күтпеген қате пайда болды: {message}

# errorFacebookCancel
source: Facebook Sign-In cancelled
kk: Facebook арқылы кіру тоқтатылды

# errorFillFields
source: Please fill in both fields
kk: Екі өрісті де толтырыңыз

# errorEnterName
source: Enter your name
kk: Атыңызды енгізіңіз

# errorEnterSurname
source: Enter your surname
kk: Тегіңізді енгізіңіз

# errorEnterEmail
source: Enter an email
kk: Электрондық поштаны енгізіңіз

# errorPasswordLength
source: Password must be at least 6 characters
kk: Құпия сөз кемінде 6 таңбадан тұруы керек

# errorLoadPosts
source: Failed to load posts: {error}
kk: Жазбаларды жүктеу сәтсіз аяқталды: {error}

# errorAddPost
source: Failed to add post: {error}
kk: Жазба қосу сәтсіз аяқталды: {error}

# errorEditPost
source: Failed to edit post: {error}
kk: Жазбаны өңдеу сәтсіз аяқталды: {error}

# errorDeletePost
source: Failed to delete post: {error}
kk: Жазбаны жою сәтсіз аяқталды: {error}

# errorToggleLike
source: Failed to toggle like: {error}
kk: Ұнату/ұнатпау сәтсіз аяқталды: {error}

# weeklyFitnessChallengeTitle
source: Weekly Fitness Challenge
kk: Апталық Фитнес Сынағы

# weeklyFitnessChallengeContent
source: Join our 7-day cardio challenge and share your progress!
kk: 7 күндік кардио сынағына қосылыңыз және жетістіктеріңізді бөлісіңіз!

# fitnessGuruAuthor
source: FitnessGuru
kk: ФитнесГуру

# plankTipsTitle
source: Plank Tips
kk: Планк Бойынша Кеңестер

# plankTipsContent
source: Struggling with planks? Try these tips to improve your form.
kk: Планк жасауда қиындықтар бар ма? Формаңызды жақсарту үшін мына кеңестерді қолданып көріңіз.

# coreMasterAuthor
source: CoreMaster
kk: НегізгіШебер

# morningStretchRoutineTitle
source: Morning Stretch Routine
kk: Таңғы Созылу Рәсімі

# morningStretchRoutineContent
source: Start your day with this 10-minute stretch to boost flexibility.
kk: Күніңізді икемділікті арттыратын 10 минуттық созылумен бастаңыз.

# yogaFanAuthor
source: YogaFan
kk: ЙогаЖанкүйері

# proteinShakeRecipesTitle
source: Protein Shake Recipes
kk: Протеин Коктейль Рецепттері

# proteinShakeRecipesContent
source: Share your favorite post-workout shake recipes here!
kk: Жаттығудан кейінгі сүйікті коктейль рецепттеріңізді осында бөлісіңіз!

# nutritionNutAuthor
source: NutritionNut
kk: ТамақтануМаманы

# errorLoadProgress
source: Failed to load progress: {error}
kk: Жетістіктерді жүктеу сәтсіз аяқталды: {error}

# errorSaveChallengeProgress
source: Failed to save challenge progress: {error}
kk: Сынақ жетістіктерін сақтау сәтсіз аяқталды: {error}

# errorSaveWorkoutProgress
source: Failed to save workout progress: {error}
kk: Жаттығу жетістіктерін сақтау сәтсіз аяқталды: {error}

# errorResetProgress
source: Failed to reset progress: {error}
kk: Жетістіктерді қалпына келтіру сәтсіз аяқталды: {error}

# errorUpdateTotalMinutes
source: Failed to update total minutes: {error}
kk: Жалпы минуттарды жаңарту сәтсіз аяқталды: {error}

# errorChallengeNotFound
source: Challenge {title} not found
kk: {title} сынағы табылмады

# errorWorkoutNotFound
source: Workout {title} not found
kk: {title} жаттығуы табылмады

# fullBodyChallengeTitle
source: Full Body Challenge
kk: Толық Дене Сынағы

# fullBodyChallengeSubtitle
source: Complete Body Focus
kk: Толық Дене Фокусы

# plankChallengeTitle
source: Plank Challenge
kk: Планк Сынағы

# plankChallengeSubtitle
source: Build Core Strength
kk: Негізгі Күшті Қалыптастыру

# fitIn15Title
source: Fit in 15
kk: 15 Минутта Фитнес

# fitIn15Subtitle
source: Quick Daily Workouts
kk: Жылдам Күнделікті Жаттығулар

# cardioBlastTitle
source: Cardio Blast
kk: Кардио Жарылысы

# cardioBlastSubtitle
source: Burn Calories Fast
kk: Калорияларды Жылдам Жағу

# goldsGymVeniceTitle
source: Gold's Gym Venice
kk: Венециядағы Gold's Gym

# goldsGymVeniceSubtitle
source: The Mecca of Bodybuilding
kk: Бодибилдингтің Меккесі

# goldsGymVeniceAddress
source: 360 Hampton Dr, Venice
kk: Венеция, Хэмптон Др, 360

# planetFitnessSubtitle
source: Affordable and local
kk: Қолжетімді және жергілікті

# planetFitnessAddress
source: 456 Fitness Rd, HealthyTown
kk: Фитнес Жолы, 456

# chestWorkoutTitle
source: Chest Workout
kk: Кеуде Жаттығуы

# chestWorkoutDuration
source: 30 minutes
kk: 30 минут

# legWorkoutTitle
source: Leg Workout
kk: Аяқ Жаттығуы

# legWorkoutDuration
source: 45 minutes
kk: 45 минут

# plankWorkoutTitle
source: Plank
kk: Планк

# plankWorkoutDuration
source: 15 minutes
kk: 15 минут

# backWorkoutTitle
source: Back Workout
kk: Арқа Жаттығуы

# backWorkoutDuration
source: 40 minutes
kk: 40 минут

# jumpingJacksName
source: Jumping Jacks
kk: Секіру Джектері

# jumpingJacksDuration
source: 3 sets of 30 seconds
kk: 3 жиынты_Desktop development with C++_к 30 секунд

# highKneesName
source: High Knees
kk: Жоғары Тізелер

# highKneesDuration
source: 3 sets of 30 seconds
kk: 3 жиынтық 30 секунд

# burpeesName
source: Burpees
kk: Бөрпелер

# burpeesDuration
source: 3 sets of 15 reps
kk: 3 жиынтық 15 қайталау

# pushUpsName
source: Push-ups
kk: Отжимания

# pushUpsDuration
source: 3 sets of 15 reps
kk: 3 жиынтық 15 қайталау

# squatsName
source: Squats
kk: Приседания

# squatsDuration
source: 3 sets of 20 reps
kk: 3 жиынтық 20 қайталау

# plankName
source: Plank
kk: Планк

# plankDuration
source: 3 sets of 30 seconds
kk: 3 жиынтық 30 секунд

# standardPlankName
source: Standard Plank
kk: Стандартты Планк

# standardPlankDuration
source: 3 sets of 30 seconds
kk: 3 жиынтық 30 секунд

# sidePlankName
source: Side Plank
kk: Бүйірлік Планк

# sidePlankDuration
source: 3 sets of 20 seconds
kk: 3 жиынтық 20 секунд

source: Unknown error
kk: Белгісіз қате

# plankWithLegLiftName
source: Plank with Leg Lift
kk: Аяқты Көтерумен Планк

# plankWithLegLiftDuration
source: 3 sets of 20 seconds
kk: 3 жиынтық 20 секунд

# mountainClimbersName
source: Mountain Climbers
kk: Тау Альпинистері

# mountainClimbersDuration
source: 3 sets of 30 seconds
kk: 3 жиынтық 30 секунд

# totalDurationLabel
source: Total Duration:
kk: Жалпы Ұзақтығы:

# minutesLabel
source: min
kk: мин

# lungesName
source: Lunges
kk: Қадамдар

# lungesDuration
source: 3 sets of 15 reps
kk: 3 жиынтық 15 қайталау

# bicycleCrunchesName
source: Bicycle Crunches
kk: Велосипедті Қысу

# bicycleCrunchesDuration
source: 3 sets of 20 reps
kk: 3 жиынтық 20 қайталау

source: Description
kk: Сипаттама

source: Delete
kk: Жою

# pushUpsSteps
source: Start in a plank position with hands shoulder-width apart. Lower your body until your chest nearly touches the floor. Push back up to the starting position. Repeat for the desired number of reps.
kk: Қолдарды иық енінде орналастырып, планка позициясынан бастаңыз. Денеңізді кеуде еденге жақын болғанша түсіріңіз. Бастапқы позицияға қайта көтеріңіз. Қалаған қайталау санын орындаңыз.

# squatsSteps
source: Stand with feet shoulder-width apart. Lower your body by bending your knees and hips. Keep your back straight and knees over toes. Return to the starting position. Repeat for the desired number of reps.
kk: Аяқтарды иық енінде орналастырып, тік тұрыңыз. Тізе мен жамбасты бүгіп, денеңізді төмендетіңіз. Арқаңызды тік ұстаңыз және тізелеріңіз саусақтарыңыздың үстінде болсын. Бастапқы позицияға оралыңыз. Қалаған қайталау санын орындаңыз.

# bodyPartChest
source: Chest
kk: Кеуде

# bodyPartLegs
source: Legs
kk: Аяқтар

# equipmentNone
source: None
kk: Ешқандай

# equipmentMat
source: Mat
kk: Төсеніш

source: Beginner
kk: Бастаушы

source: Intermediate
kk: Орташа

source: Advanced
kk: Жетілдірілген

# plankSteps
source: Get into position: Begin by lying face down on the floor or mat. Place your forearms on the ground, elbows under shoulders. Lift your body, keeping a straight line from head to heels. Hold for the desired time.
kk: Позицияға кіріңіз: Еденде немесе кілемде бетіңізді төмен қаратып жатыңыз. Білектеріңізді жерге қойыңыз, шынтақтар иық астында. Денеңізді көтеріңіз, басынан өкшеге дейін түзу сызық сақтаңыз. Қажетті уақыт ұстаңыз.

# bodyPartShoulders
source: Shoulders
kk: Иықтар

# bodyPartTriceps
source: Triceps
kk: Трицепс

# bodyPartGlutes
source: Glutes
kk: Бөкселер

# bodyPartChestShouldersTriceps
source: Chest, Shoulders, Triceps
kk: Кеуде, Иықтар, Трицепс

# bodyPartLegsGlutes
source: Legs, Glutes
kk: Аяқтар, Бөкселер

# bodyPartCore
source: Core
kk: Іш бұлшықеттері

source: Exercise {name}
kk: Жаттығу {name}

source: Body Part {value}
kk: Дене бөлігі {value}

source: Difficulty {value}
kk: Қиындық деңгейі {value}

source: Equipment {value}
kk: Жабдық {value}

# startedCount
source: {count} Started
kk: {count} Бастау алған

# completedCount
source: {count} Completed
kk: {count} Аяқталған
